Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_dma.h
/**
  ******************************************************************************
  * @file    py32e407_hal_dma.h
  * @author  MCU Application Team
  * @brief   Header file of DMA HAL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32E407_HAL_DMA_H
#define __PY32E407_HAL_DMA_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32e407_hal_def.h"

/** @addtogroup PY32E407_HAL_Driver
  * @{
  */

/** @addtogroup DMA
  * @{
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup DMA_Exported_Types DMA Exported Types
  * @{
  */

/**
  * @brief  DMA Configuration Structure definition
  */
typedef struct
{
  uint32_t Direction;                 /*!< Specifies transfer direction.
                                           This parameter can be a value of @ref DMA_Data_transfer_direction */
  
  uint32_t SrcWidth;                  /*!< Specifies source transfer width.
                                           This parameter can be a value of @ref DMA_Source_Transfer_Width */
  
  uint32_t DstWidth;                  /*!< Specifies destination transfer width.
                                           This parameter can be a value of @ref DMA_Destination_Transfer_Width */
  
  uint32_t SrcBurstLen;               /*!< Specifies source burst transaction length.
                                           This parameter can be a value of @ref DMA_Source_Burst_Transaction_Length
                                           @note This configuration is for peripheral，not for memory */
  
  uint32_t DstBurstLen;               /*!< Specifies destination burst transaction length.
                                           This parameter can be a value of @ref DMA_Destination_Burst_Transaction_Length 
                                           @note This configuration is for peripheral，not for memory */
  
  uint32_t SrcInc;                    /*!< Specifies source address increment.
                                           This parameter can be a value of @ref DMA_Source_Address_Increment */
  
  uint32_t DstInc;                   /*!< Specifies destination address increment.
                                           This parameter can be a value of @ref DMA_Destination_Address_Increment */
  
  uint32_t Mode;                      /*!< Specifies the operation mode of the DMA Channelx.
                                           This parameter can be a value of @ref DMA_mode 
                                           @note In circular mode, the maximum circular transfer length does not exceed 4095.*/
  
  uint32_t SrcReload;                 /*!< Specifies whether source reload is enabled.
                                           This parameter can be a value of @ref DMA_Source_Reload
                                           @note This configuration is used for DMA_CIRCULAR mode and not for DMA_NORMAL mode, 
                                                 SrcReload and DstReload Cannot be configured to disable at the same time  */
  
  uint32_t DstReload;                 /*!< Specifies whether destination reload is enabled.
                                           This parameter can be a value of @ref DMA_Destination_Reload
                                           @note This configuration is used for DMA_CIRCULAR mode and not for DMA_NORMAL mode, 
                                                 SrcReload and DstReload Cannot be configured to disable at the same time  */
  
  uint32_t SrcHandshakeType;          /*!< Specifies source handshake type.
                                           This parameter can be a value of @ref DMA_Source_Handshake_Type
                                           @note This configuration is for peripheral，not for memory */
  
  uint32_t DstHandshakeType;          /*!< Specifies destination handshake type.
                                           This parameter can be a value of @ref DMA_Destination_Handshake_Type
                                           @note This configuration is for peripheral，not for memory */
  
  uint32_t Priority;                  /*!< Specifies channel priority.
                                           This parameter can be a value of @ref DMA_Priority_level */
  
  uint32_t BlockMaxLen;               /*!<  Specifies the maximum length of a block.
                                            This parameter must be a number between Min_Data = 1 and Max_Data = 4095.
                                            Macro DMA_BLOCK_DEFAULT_MAX_LEN is the default maximum length of a block. */

} DMA_InitTypeDef;

/**
  * @brief  HAL DMA State structures definition
  */
typedef enum
{
  HAL_DMA_STATE_RESET             = 0x00U,  /*!< DMA not yet initialized or disabled    */
  HAL_DMA_STATE_READY             = 0x01U,  /*!< DMA initialized and ready for use      */
  HAL_DMA_STATE_BUSY              = 0x02U,  /*!< DMA process is ongoing                 */
  HAL_DMA_STATE_TIMEOUT           = 0x03U   /*!< DMA timeout state                      */
}HAL_DMA_StateTypeDef;

/**
  * @brief  HAL DMA Error Code structure definition
  */
typedef enum
{
  HAL_DMA_FULL_TRANSFER           = 0x00U,    /*!< Full transfer     */
  HAL_DMA_HALF_BLOCK_TRANSFER     = 0x01U     /*!< Half block Transfer     */
}HAL_DMA_LevelCompleteTypeDef;

/** 
  * @brief  HAL DMA Callback ID structure definition
  */
typedef enum
{
  HAL_DMA_XFER_CPLT_CB_ID            = 0x00U,    /*!< DMA transfer complete     */
  HAL_DMA_XFER_BLOCK_CPLT_CB_ID      = 0x01U,    /*!< DMA block transfer complete     */
  HAL_DMA_XFER_HALFBLOCK_CPLT_CB_ID  = 0x02U,    /*!< DMA half block transfer complete     */
  HAL_DMA_XFER_SRCTRAN_CPLT_CB_ID    = 0x03U,    /*!< DMA source transaction complete     */
  HAL_DMA_XFER_DSTTRAN_CPLT_CB_ID    = 0x04U,    /*!< DMA destination transaction complete     */
  HAL_DMA_XFER_ERROR_CB_ID           = 0x05U,    /*!< Error             */
  HAL_DMA_XFER_ABORT_CB_ID           = 0x06U,    /*!< Abort             */
  HAL_DMA_XFER_ALL_CB_ID             = 0x07U     /*!< All               */
    
}HAL_DMA_CallbackIDTypeDef;

/** 
  * @brief  DMA handle Structure definition
  */
typedef struct __DMA_HandleTypeDef
{
  DMA_Channel_TypeDef   *Instance;                       /*!< Register base address                  */
  
