Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_dma.h
  DMA_InitTypeDef       Init;                            /*!< DMA communication parameters           */ 
  
  HAL_LockTypeDef       Lock;                            /*!< DMA locking object                     */  
  
  HAL_DMA_StateTypeDef  State;                           /*!< DMA transfer state                     */
  
  void                  *Parent;                                                      /*!< Parent object state                    */  
  
  void                  (* XferCpltCallback)( struct __DMA_HandleTypeDef * hdma);          /*!< DMA transfer complete callback         */
  
  void                  (* XferBlockCpltCallback)( struct __DMA_HandleTypeDef * hdma);     /*!< DMA block transfer complete callback         */
  
  void                  (* XferHalfBlockCpltCallback)( struct __DMA_HandleTypeDef * hdma); /*!< DMA half block transfer complete callback         */
  
  void                  (* XferSrcTranCpltCallback)( struct __DMA_HandleTypeDef * hdma);   /*!< DMA source transaction complete callback         */
  
  void                  (* XferDstTranCpltCallback)( struct __DMA_HandleTypeDef * hdma);   /*!< DMA destination transaction complete callback         */
  
  void                  (* XferErrorCallback)( struct __DMA_HandleTypeDef * hdma);         /*!< DMA transfer error callback            */

  void                  (* XferAbortCallback)( struct __DMA_HandleTypeDef * hdma);         /*!< DMA transfer abort callback            */  
  
  __IO uint32_t         ErrorCode;                                                    /*!< DMA Error code                         */

  DMA_TypeDef            *DmaBaseAddress;                                             /*!< DMA Channel Base Address               */
  
  uint32_t               ChannelIndex;                                                /*!< DMA Channel Index                      */  
  
  __IO uint32_t          BlockNum;                                                    /* Number of blocks to be transfered */
  
  __IO uint32_t          RemainLen;                                                   /* Length remaining to be transfered (not enough for one block length) */

} DMA_HandleTypeDef;    
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup DMA_Exported_Constants DMA Exported Constants
  * @{
  */

/** @defgroup DMA_Error_Code DMA Error Code
  * @{
  */
#define HAL_DMA_ERROR_NONE                     0x00000000U    /*!< No error             */
#define HAL_DMA_ERROR_TE                       0x00000001U    /*!< Transfer error       */
#define HAL_DMA_ERROR_NO_XFER                  0x00000004U    /*!< no ongoing transfer  */
#define HAL_DMA_ERROR_TIMEOUT                  0x00000020U    /*!< Timeout error        */
#define HAL_DMA_ERROR_NOT_SUPPORTED            0x00000100U    /*!< Not supported mode   */ 
/**
  * @}
  */

/** @defgroup DMA_Data_transfer_direction DMA Data transfer direction
  * @{
  */
#define DMA_MEMORY_TO_MEMORY         0x00000000U                       /*!< Memory to memory direction     */
#define DMA_MEMORY_TO_PERIPH         ((uint32_t)DMA_CH_CTRLL_TT_0)     /*!< Memory to peripheral direction */
#define DMA_PERIPH_TO_MEMORY         ((uint32_t)DMA_CH_CTRLL_TT_1)     /*!< Peripheral to memory direction */
#define DMA_PERIPH_TO_PERIPH         ((uint32_t)DMA_CH_CTRLL_TT)       /*!< Peripheral to Peripheral direction */
/**
  * @}
  */

/** @defgroup DMA_Source_Transfer_Width DMA Source Transfer Width
  * @{
  */
#define DMA_SRC_WIDTH_BYTE         0x00000000U                                 /*!< Source transfer width is 8 bits     */
#define DMA_SRC_WIDTH_HALFWORD     ((uint32_t)DMA_CH_CTRLL_SRC_TR_WIDTH_0)     /*!< Source transfer width is 16 bits     */
#define DMA_SRC_WIDTH_WORD         ((uint32_t)DMA_CH_CTRLL_SRC_TR_WIDTH_1)     /*!< Source transfer width is 32 bits     */
/**
  * @}
  */

/** @defgroup DMA_Destination_Transfer_Width DMA Destination Transfer Width
  * @{
  */
#define DMA_DST_WIDTH_BYTE         0x00000000U                                 /*!< Destination transfer width is 8 bits     */
#define DMA_DST_WIDTH_HALFWORD     ((uint32_t)DMA_CH_CTRLL_DST_TR_WIDTH_0)     /*!< Destination transfer width is 16 bits     */
#define DMA_DST_WIDTH_WORD         ((uint32_t)DMA_CH_CTRLL_DST_TR_WIDTH_1)     /*!< Destination transfer width is 32 bits     */
/**
  * @}
  */

/** @defgroup DMA_Source_Burst_Transaction_Length DMA Source Burst Transaction Length
  * @{
  */
#define DMA_SRC_BURST_LEN_1         0x00000000U                                                           /*!< Number of data items to be transferred is 1     */
#define DMA_SRC_BURST_LEN_4         ((uint32_t)DMA_CH_CTRLL_SRC_MSIZE_0)                                  /*!< Number of data items to be transferred is 4     */
#define DMA_SRC_BURST_LEN_8         ((uint32_t)DMA_CH_CTRLL_SRC_MSIZE_1)                                  /*!< Number of data items to be transferred is 8     */
#define DMA_SRC_BURST_LEN_16        ((uint32_t)(DMA_CH_CTRLL_SRC_MSIZE_1 | DMA_CH_CTRLL_SRC_MSIZE_0))     /*!< Number of data items to be transferred is 16     */
#define DMA_SRC_BURST_LEN_32        ((uint32_t)DMA_CH_CTRLL_SRC_MSIZE_2)                                  /*!< Number of data items to be transferred is 32     */
#define DMA_SRC_BURST_LEN_64        ((uint32_t)(DMA_CH_CTRLL_SRC_MSIZE_2 | DMA_CH_CTRLL_SRC_MSIZE_0))     /*!< Number of data items to be transferred is 64     */
#define DMA_SRC_BURST_LEN_128       ((uint32_t)(DMA_CH_CTRLL_SRC_MSIZE_2 | DMA_CH_CTRLL_SRC_MSIZE_1))     /*!< Number of data items to be transferred is 128     */
/**
  * @}
  */

/** @defgroup DMA_Destination_Burst_Transaction_Length DMA Destination Burst Transaction Length
  * @{
  */
#define DMA_DST_BURST_LEN_1         0x00000000U                                                           /*!< Number of data items to be transferred is 1     */
#define DMA_DST_BURST_LEN_4         ((uint32_t)DMA_CH_CTRLL_DST_MSIZE_0)                                  /*!< Number of data items to be transferred is 4     */
#define DMA_DST_BURST_LEN_8         ((uint32_t)DMA_CH_CTRLL_DST_MSIZE_1)                                  /*!< Number of data items to be transferred is 8     */
#define DMA_DST_BURST_LEN_16        ((uint32_t)(DMA_CH_CTRLL_DST_MSIZE_1 | DMA_CH_CTRLL_DST_MSIZE_0))     /*!< Number of data items to be transferred is 16     */
#define DMA_DST_BURST_LEN_32        ((uint32_t)DMA_CH_CTRLL_DST_MSIZE_2)                                  /*!< Number of data items to be transferred is 32     */
#define DMA_DST_BURST_LEN_64        ((uint32_t)(DMA_CH_CTRLL_DST_MSIZE_2 | DMA_CH_CTRLL_DST_MSIZE_0))     /*!< Number of data items to be transferred is 64     */
#define DMA_DST_BURST_LEN_128       ((uint32_t)(DMA_CH_CTRLL_DST_MSIZE_2 | DMA_CH_CTRLL_DST_MSIZE_1))     /*!< Number of data items to be transferred is 128     */
/**
  * @}
  */

