Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_dma.h
/** @defgroup DMA_Source_Address_Increment Source Address Increment
  * @{
  */
#define DMA_SRC_ADDR_INC            0x00000000U                       /*!< Increments the source address     */
#define DMA_SRC_ADDR_DEC            ((uint32_t)DMA_CH_CTRLL_SINC_0)   /*!< Decrements the source address     */
#define DMA_SRC_ADDR_FIX            ((uint32_t)DMA_CH_CTRLL_SINC_1)   /*!< No change in the source address     */
/**
  * @}
  */

/** @defgroup DMA_Destination_Address_Increment Destination Address Increment
  * @{
  */
#define DMA_DST_ADDR_INC            0x00000000U                       /*!< Increments the destination address     */
#define DMA_DST_ADDR_DEC            ((uint32_t)DMA_CH_CTRLL_DINC_0)   /*!< Decrements the destination address     */
#define DMA_DST_ADDR_FIX            ((uint32_t)DMA_CH_CTRLL_DINC_1)   /*!< No change in the destination address     */
/**
  * @}
  */

/** @defgroup DMA_mode DMA mode
  * @{
  */
#define DMA_NORMAL         0x00000000U                  /*!< Normal mode   */
#define DMA_CIRCULAR       0x00000001U                  /*!< Circular mode */
/**
  * @}
  */

/** @defgroup DMA_Source_Reload Source Reload
  * @{
  */
#define DMA_SRC_RELOAD_DISABLE      0x00000000U                         /*!< source reload is disabled     */
#define DMA_SRC_RELOAD_ENABLE       ((uint32_t)DMA_CH_CFGL_RELOAD_SRC)  /*!< source reload is enabled     */
/**
  * @}
  */

/** @defgroup DMA_Destination_Reload Destination Reload
  * @{
  */
#define DMA_DST_RELOAD_DISABLE      0x00000000U                         /*!< Destination reload is disabled     */
#define DMA_DST_RELOAD_ENABLE       ((uint32_t)DMA_CH_CFGL_RELOAD_DST)  /*!< Destination reload is enabled     */
/**
  * @}
  */

/** @defgroup DMA_Source_Handshake_Type Source Handshake Type
  * @{
  */
#define DMA_SRC_HS_TYPE_HARD         0x00000000U                         /*!< Select hardware handshake for source    */
#define DMA_SRC_HS_TYPE_SOFT         ((uint32_t)DMA_CH_CFGL_HS_SEL_SRC)  /*!< Select software handshake for source    */
/**
  * @}
  */

/** @defgroup DMA_Destination_Handshake_Type Destination Handshake Type
  * @{
  */
#define DMA_DST_HS_TYPE_HARD         0x00000000U                         /*!< Select hardware handshake for destination    */
#define DMA_DST_HS_TYPE_SOFT         ((uint32_t)DMA_CH_CFGL_HS_SEL_DST)  /*!< Select software handshake for destination    */
/**
  * @}
  */

/** @defgroup DMA_Priority_level DMA Priority level
  * @{
  */
#define DMA_PRIORITY_0             0x00000000U
#define DMA_PRIORITY_1             ((uint32_t)DMA_CH_CFGL_CH_PRIOR_0)
#define DMA_PRIORITY_2             ((uint32_t)DMA_CH_CFGL_CH_PRIOR_1)
#define DMA_PRIORITY_3             ((uint32_t)(DMA_CH_CFGL_CH_PRIOR_1 | DMA_CH_CFGL_CH_PRIOR_0))
#define DMA_PRIORITY_4             ((uint32_t)DMA_CH_CFGL_CH_PRIOR_2)
#define DMA_PRIORITY_5             ((uint32_t)(DMA_CH_CFGL_CH_PRIOR_2 | DMA_CH_CFGL_CH_PRIOR_0))
/**
  * @}
  */

/** @defgroup DMA_FIFO_Mode DMA FIFO mode
  * @{
  */
#define DMA_FIFO_MODE_0             0x00000000U                        /*!< Space/data available for single
                                                                            AHB transfer of the specified transfer width    */
#define DMA_FIFO_MODE_1             ((uint32_t)DMA_CH_CFGH_FIFO_MODE)  /*!< Data available is greater than or
                                                                            equal to half the FIFO depth for destination transfers and
                                                                            space available is greater than half the fifo depth for
                                                                            source transfers.     */
/**
  * @}
  */

/** @defgroup DMA_Req_Tpye DMA request type
  * @{
  */
#define DMA_REQ_TYPE_SRC  0x0U     /* DMA request from source peripheral */
#define DMA_REQ_TYPE_DST  0x1U     /* DMA request for destination peripheral */
/**
  * @}
  */

/** @defgroup DMA_Req_Num DMA request number
  * @{
  */
#define DMA_REQ_NUM_0  0U
#define DMA_REQ_NUM_1  1U
#define DMA_REQ_NUM_2  2U
#define DMA_REQ_NUM_3  3U
#define DMA_REQ_NUM_4  4U
#define DMA_REQ_NUM_5  5U
/**
  * @}
  */

/** @defgroup DMA_Req_Func DMA request function
  * @{
  */
#define DMA_REQ_FUNC_ADC1              0U
#define DMA_REQ_FUNC_ADC2              1U
#define DMA_REQ_FUNC_ADC3              2U
#define DMA_REQ_FUNC_DAC1              3U
#define DMA_REQ_FUNC_DAC2              4U
#define DMA_REQ_FUNC_SPI1_RX           5U
#define DMA_REQ_FUNC_SPI1_TX           6U
#define DMA_REQ_FUNC_SPI2_RX           7U
#define DMA_REQ_FUNC_SPI2_TX           8U
#define DMA_REQ_FUNC_SPI3_RX           9U
#define DMA_REQ_FUNC_SPI3_TX           10U
#define DMA_REQ_FUNC_USART1_RX         11U
#define DMA_REQ_FUNC_USART1_TX         12U
#define DMA_REQ_FUNC_USART2_RX         13U
#define DMA_REQ_FUNC_USART2_TX         14U
#define DMA_REQ_FUNC_USART3_RX         15U
#define DMA_REQ_FUNC_USART3_TX         16U
#define DMA_REQ_FUNC_LPUART1_RX        17U
#define DMA_REQ_FUNC_LPUART1_TX        18U
#define DMA_REQ_FUNC_I2C1_RX           19U
#define DMA_REQ_FUNC_I2C1_TX           20U
#define DMA_REQ_FUNC_I2C2_RX           21U
#define DMA_REQ_FUNC_I2C2_TX           22U
#define DMA_REQ_FUNC_I2C3_RX           23U
#define DMA_REQ_FUNC_I2C3_TX           24U
#define DMA_REQ_FUNC_I2C4_RX           25U
#define DMA_REQ_FUNC_I2C4_TX           26U
#define DMA_REQ_FUNC_TIM1_CH1          27U
#define DMA_REQ_FUNC_TIM1_CH2          28U
#define DMA_REQ_FUNC_TIM1_CH3          29U
#define DMA_REQ_FUNC_TIM1_CH4          30U
#define DMA_REQ_FUNC_TIM1_UP           31U
#define DMA_REQ_FUNC_TIM1_TRIG         32U
#define DMA_REQ_FUNC_TIM1_COM          33U
#define DMA_REQ_FUNC_TIM8_CH1          34U
#define DMA_REQ_FUNC_TIM8_CH2          35U
#define DMA_REQ_FUNC_TIM8_CH3          36U
#define DMA_REQ_FUNC_TIM8_CH4          37U
#define DMA_REQ_FUNC_TIM8_UP           38U
#define DMA_REQ_FUNC_TIM8_TRIG         39U
#define DMA_REQ_FUNC_TIM8_COM          40U
#define DMA_REQ_FUNC_TIM6_UP           41U
#define DMA_REQ_FUNC_TIM7_UP           42U
#define DMA_REQ_FUNC_TIM2_CH1          43U
#define DMA_REQ_FUNC_TIM2_CH2          44U
#define DMA_REQ_FUNC_TIM2_CH3          45U
#define DMA_REQ_FUNC_TIM2_CH4          46U
#define DMA_REQ_FUNC_TIM2_UP           47U
#define DMA_REQ_FUNC_TIM2_TRIG         48U
#define DMA_REQ_FUNC_TIM3_CH1          49U
#define DMA_REQ_FUNC_TIM3_CH2          50U
#define DMA_REQ_FUNC_TIM3_CH3          51U
#define DMA_REQ_FUNC_TIM3_CH4          52U
#define DMA_REQ_FUNC_TIM3_UP           53U
#define DMA_REQ_FUNC_TIM3_TRIG         54U
#define DMA_REQ_FUNC_TIM4_CH1          55U
#define DMA_REQ_FUNC_TIM4_CH2          56U
#define DMA_REQ_FUNC_TIM4_CH3          57U
#define DMA_REQ_FUNC_TIM4_CH4          58U
#define DMA_REQ_FUNC_TIM4_UP           59U
#define DMA_REQ_FUNC_TIM4_TRIG         60U
#define DMA_REQ_FUNC_TIM5_CH1          61U
#define DMA_REQ_FUNC_TIM5_CH2          62U
#define DMA_REQ_FUNC_TIM5_CH3          63U
#define DMA_REQ_FUNC_TIM5_CH4          64U
#define DMA_REQ_FUNC_TIM5_UP           65U
#define DMA_REQ_FUNC_TIM5_TRIG         66U
#define DMA_REQ_FUNC_TIM18_CH1         67U
#define DMA_REQ_FUNC_TIM18_CH2         68U
#define DMA_REQ_FUNC_TIM18_CH3         69U
#define DMA_REQ_FUNC_TIM18_CH4         70U
#define DMA_REQ_FUNC_TIM18_UP          71U
#define DMA_REQ_FUNC_TIM18_TRIG        72U
#define DMA_REQ_FUNC_TIM15_CH1         73U

#define DMA_REQ_FUNC_TIM15_UP          75U
#define DMA_REQ_FUNC_TIM15_TRIG        76U
#define DMA_REQ_FUNC_TIM15_COM         77U
#define DMA_REQ_FUNC_TIM16_CH1         78U
#define DMA_REQ_FUNC_TIM16_UP          79U
#define DMA_REQ_FUNC_TIM17_CH1         80U
#define DMA_REQ_FUNC_TIM17_UP          81U
#define DMA_REQ_FUNC_AES_IN            82U
#define DMA_REQ_FUNC_AES_OUT           83U
#define DMA_REQ_FUNC_CORDIC_RD         84U
#define DMA_REQ_FUNC_CORDIC_WR         85U
#define DMA_REQ_FUNC_ESMC_RX           86U
#define DMA_REQ_FUNC_ESMC_TX           87U
#define DMA_REQ_FUNC_SDIO              88U
#define DMA_REQ_FUNC_UART1_RX          89U
#define DMA_REQ_FUNC_UART1_TX          90U
#define DMA_REQ_FUNC_UART2_RX          91U
#define DMA_REQ_FUNC_UART2_TX          92U
#define DMA_REQ_FUNC_UART3_RX          93U
#define DMA_REQ_FUNC_UART3_TX          94U
#define DMA_REQ_FUNC_LCDC_TX           95U

#define DMA_REQ_FUNC_END               96U

/**
  * @}
  */

/** @defgroup DMA_Block_Default_Max_Len The default maximum length of a block
  * @{
  */
#define DMA_BLOCK_DEFAULT_MAX_LEN  4095U     /*!< The default maximum length of a block    */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup DMA_Exported_Macros DMA Exported Macros
  * @{
  */

/** @brief  Reset DMA handle state.
  * @param  __HANDLE__: DMA handle
  * @retval None
  */
#define __HAL_DMA_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_DMA_STATE_RESET)

/**
  * @brief  Set maximum AMBA burst length that is used for DMA transfers on this channel.
  * @param  __HANDLE__: DMA handle
  * @param  __LEN__   : Maximum AMBA burst length
  * @retval None
  */
#define __HAL_DMA_SET_MAX_ABRST_LEN(__HANDLE__, __LEN__)  MODIFY_REG((__HANDLE__)->Instance->CH_CFGL, DMA_CH_CFGL_MAX_ABRST, (__LEN__ << DMA_CH_CFGL_MAX_ABRST_Pos))

/**
  * @brief  Get maximum AMBA burst length that is used for DMA transfers on this channel.
  * @param  __HANDLE__: DMA handle
  * @retval maximum AMBA burst length that is used for DMA transfers on this channel.
  */
#define __HAL_DMA_GET_MAX_ABRST_LEN(__HANDLE__)          (READ_BIT((__HANDLE__)->Instance->CH_CFGL, DMA_CH_CFGL_MAX_ABRST) >> DMA_CH_CFGL_MAX_ABRST_Pos)

/**
  * @brief  Enable the specified DMA Channel block interrupt pending(multiblock transfer).
  * @param  __HANDLE__: DMA handle
  * @retval None
  */
#define __HAL_DMA_ENABLE_BLOCK_INT_SUSPEND(__HANDLE__)    SET_BIT((__HANDLE__)->Instance->CH_CFGL, DMA_CH_CFGL_INT_SUSP)

/**
  * @brief  Disable the specified DMA Channel block interrupt pending(multiblock transfer).
  * @param  __HANDLE__: DMA handle
  * @retval None
  */
#define __HAL_DMA_DISABLE_BLOCK_INT_SUSPEND(__HANDLE__)   CLEAR_BIT((__HANDLE__)->Instance->CH_CFGL, DMA_CH_CFGL_INT_SUSP)

/**
  * @brief  Set the specified DMA Channel DMA FIFO mode.
  * @param  __HANDLE__: DMA handle
  * @param  __MODE__   : FIFO mode
  *          This parameter can be any combination of the following values:
  *            @arg DMA_FIFO_MODE_0:  Space/data available for single AHB transfer of the
  *                                   specified transfer width.
  *            @arg DMA_FIFO_MODE_1:  Data available is greater than or equal to half the FIFO
  *                                   depth for destination transfers and space available is
  *                                   greater than half the fifo depth for source transfers.
  * @retval None
  */
#define __HAL_DMA_SET_FIFO_MODE(__HANDLE__, __MODE__)  MODIFY_REG((__HANDLE__)->Instance->CH_CFGH, DMA_CH_CFGH_FIFO_MODE, __MODE__)

/**
  * @brief  Get the specified DMA Channel DMA FIFO mode.
  * @param  __HANDLE__: DMA handle
  * @retval Returned value can be one of the following values:
  *         @arg @ref DMA_FIFO_MODE_0
  *         @arg @ref DMA_FIFO_MODE_1
  */
#define __HAL_DMA_GET_FIFO_MODE(__HANDLE__)  READ_BIT((__HANDLE__)->Instance->CH_CFGH, DMA_CH_CFGH_FIFO_MODE)

/**
  * @brief  Whether the specified DMA Channel FIFO is empty.
  * @retval State of bit (1 or 0).
  */
#define __HAL_DMA_IS_FIFO_EMPTY(__HANDLE__)  (READ_BIT((__HANDLE__)->Instance->CH_CFGL, DMA_CH_CFGL_FIFO_EMPTY) == (DMA_CH_CFGL_FIFO_EMPTY))
/**
  * @}
  */

