Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_dma.h
/* Include DMA HAL Extension module */
#include "py32e407_hal_dma_ex.h"   

/* Exported functions --------------------------------------------------------*/
/** @addtogroup DMA_Exported_Functions
  * @{
  */

/** @addtogroup DMA_Exported_Functions_Group1
  * @{
  */
/* Initialization and de-initialization functions *****************************/
HAL_StatusTypeDef HAL_DMA_Init(DMA_HandleTypeDef *hdma);
HAL_StatusTypeDef HAL_DMA_DeInit(DMA_HandleTypeDef *hdma);
/**
  * @}
  */

/** @addtogroup DMA_Exported_Functions_Group2
  * @{
  */
/* IO operation functions *****************************************************/
HAL_StatusTypeDef HAL_DMA_Start(DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength);
HAL_StatusTypeDef HAL_DMA_Start_IT(DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength);
HAL_StatusTypeDef HAL_DMA_Abort(DMA_HandleTypeDef *hdma);
HAL_StatusTypeDef HAL_DMA_Abort_IT(DMA_HandleTypeDef *hdma);
HAL_StatusTypeDef HAL_DMA_PollForTransfer(DMA_HandleTypeDef *hdma, uint32_t CompleteLevel, uint32_t Timeout);
void HAL_DMA_IRQHandler(DMA_HandleTypeDef *hdma);
HAL_StatusTypeDef HAL_DMA_RegisterCallback(DMA_HandleTypeDef *hdma, HAL_DMA_CallbackIDTypeDef CallbackID, void (* pCallback)( DMA_HandleTypeDef * _hdma));
HAL_StatusTypeDef HAL_DMA_UnRegisterCallback(DMA_HandleTypeDef *hdma, HAL_DMA_CallbackIDTypeDef CallbackID);
void HAL_DMA_ChannelReq(DMA_HandleTypeDef *hdma, uint32_t ReqType, uint32_t ReqNum, uint32_t ReqFunc);

/**
  * @}
  */

/** @addtogroup DMA_Exported_Functions_Group3
  * @{
  */
/* Peripheral State and Error functions ***************************************/
HAL_DMA_StateTypeDef HAL_DMA_GetState(DMA_HandleTypeDef *hdma);
uint32_t HAL_DMA_GetError(DMA_HandleTypeDef *hdma);
/**
  * @}
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup DMA_Private_Macros DMA Private Macros
  * @{
  */

#define IS_DMA_DIRECTION(DIRECTION) (((DIRECTION) == DMA_PERIPH_TO_MEMORY) || \
                                     ((DIRECTION) == DMA_MEMORY_TO_PERIPH)  || \
                                     ((DIRECTION) == DMA_MEMORY_TO_MEMORY)  || \
                                     ((DIRECTION) == DMA_PERIPH_TO_PERIPH))

#define IS_DMA_SRC_WIDTH(WIDTH)      (((WIDTH) == DMA_SRC_WIDTH_BYTE) || \
                                      ((WIDTH) == DMA_SRC_WIDTH_HALFWORD) || \
                                      ((WIDTH) == DMA_SRC_WIDTH_WORD))
                                     
#define IS_DMA_DST_WIDTH(WIDTH)      (((WIDTH) == DMA_DST_WIDTH_BYTE) || \
                                      ((WIDTH) == DMA_DST_WIDTH_HALFWORD) || \
                                      ((WIDTH) == DMA_DST_WIDTH_WORD))

#define IS_DMA_SRC_BURST_LEN(LEN)    (((LEN) == DMA_SRC_BURST_LEN_1) || \
                                      ((LEN) == DMA_SRC_BURST_LEN_4) || \
                                      ((LEN) == DMA_SRC_BURST_LEN_8) || \
                                      ((LEN) == DMA_SRC_BURST_LEN_16) || \
                                      ((LEN) == DMA_SRC_BURST_LEN_32) || \
                                      ((LEN) == DMA_SRC_BURST_LEN_64) || \
                                      ((LEN) == DMA_SRC_BURST_LEN_128))
                                      
#define IS_DMA_DST_BURST_LEN(LEN)    (((LEN) == DMA_DST_BURST_LEN_1) || \
                                      ((LEN) == DMA_DST_BURST_LEN_4) || \
                                      ((LEN) == DMA_DST_BURST_LEN_8) || \
                                      ((LEN) == DMA_DST_BURST_LEN_16) || \
                                      ((LEN) == DMA_DST_BURST_LEN_32) || \
                                      ((LEN) == DMA_DST_BURST_LEN_64) || \
                                      ((LEN) == DMA_DST_BURST_LEN_128))

#define IS_DMA_SRC_INC(INC)          (((INC) == DMA_SRC_ADDR_INC) || \
                                      ((INC) == DMA_SRC_ADDR_DEC) || \
                                      ((INC) == DMA_SRC_ADDR_FIX))

#define IS_DMA_DST_INC(INC)          (((INC) == DMA_DST_ADDR_INC) || \
                                      ((INC) == DMA_DST_ADDR_DEC) || \
                                      ((INC) == DMA_DST_ADDR_FIX))

#define IS_DMA_MODE(MODE)            (((MODE) == DMA_NORMAL ) || \
                                      ((MODE) == DMA_CIRCULAR))

#define IS_DMA_SRC_RELOAD(VALUE)      (((VALUE) == DMA_SRC_RELOAD_DISABLE) || \
                                       ((VALUE) == DMA_SRC_RELOAD_ENABLE))

#define IS_DMA_DST_RELOAD(VALUE)      (((VALUE) == DMA_DST_RELOAD_DISABLE) || \
                                       ((VALUE) == DMA_DST_RELOAD_ENABLE))

#define IS_DMA_SRC_HS(TYPE)          (((TYPE) == DMA_SRC_HS_TYPE_HARD) || \
                                      ((TYPE) == DMA_SRC_HS_TYPE_SOFT))

#define IS_DMA_DST_HS(TYPE)          (((TYPE) == DMA_DST_HS_TYPE_HARD) || \
                                      ((TYPE) == DMA_DST_HS_TYPE_SOFT))

#define IS_DMA_PRIORITY(PRIORITY)      (((PRIORITY) == DMA_PRIORITY_0 ) || \
                                        ((PRIORITY) == DMA_PRIORITY_1)  || \
                                        ((PRIORITY) == DMA_PRIORITY_2)  || \
                                        ((PRIORITY) == DMA_PRIORITY_3)  || \
                                        ((PRIORITY) == DMA_PRIORITY_4)  || \
                                        ((PRIORITY) == DMA_PRIORITY_5))

#define IS_DMA_REQ_TYPE(VALUE)        (((VALUE) == DMA_REQ_TYPE_SRC ) || \
                                        ((VALUE) == DMA_REQ_TYPE_DST))

#define IS_DMA_REQ_NUM(VALUE)          (((VALUE) == DMA_REQ_NUM_0) || \
                                        ((VALUE) == DMA_REQ_NUM_1)  || \
                                        ((VALUE) == DMA_REQ_NUM_2)  || \
                                        ((VALUE) == DMA_REQ_NUM_3)  || \
                                        ((VALUE) == DMA_REQ_NUM_4)  || \
                                        ((VALUE) == DMA_REQ_NUM_5))

#define IS_DMA_REQ_FUNC(VALUE)         (((VALUE) <  DMA_REQ_FUNC_END) && ((VALUE) != 74U))

#define IS_DMA_BLOCK_MAX_LEN(VALUE)    (((VALUE) >=  1U) && ((VALUE) <= 4095U))

/**
  * @}
  */ 

/* Private functions ---------------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32E407_HAL_DMA_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
